[
    {
        "title": "Academic Exchange Conference for Chinese and International Postgraduates",
        "date": "June 2025",
        "location": "Hefei, Anhui, China",
        "description": "Participating in this conference filled me with a profound sense of excitement and gratitude. Sharing my research alongside peers from diverse cultural and disciplinary backgrounds helped me see my own work through fresh perspectives and reminded me how universal our scientific curiosity really is. Each presentation, question, and informal hallway conversation sparked new ideas and collaborations that I’m eager to pursue. Beyond the academic gains, the conference fostered genuine camaraderie: we exchanged stories about our countries, laughed over language mishaps, and discovered just how much we have in common despite different origins. Walking away, I feel inspired, more confident in my research trajectory, and deeply motivated to contribute to this vibrant global community of young scholars. ",
        "image_soruce":"./events/images/event1.jpg"
    },
    {
        "title": "Sino- Foreigner Culture Exchange Festival",
        "date": "November 2024",
        "location": "University Of science and Technology Of China(USTC), Anhui, China",
        "description": "Participating in the Sino-Foreigner Culture Exchange Festival was an incredible experience for me, as I had the honor of representing Egyptian culture.I felt a deep sense of pride as I showcased the rich history and traditions of Egypt. Being surrounded by diverse cultures was inspiring, and I appreciated the opportunity to share our unique heritage with others. The vibrant atmosphere filled with laughter, music, and colorful displays made me feel connected to people from all over the world.This festival not only allowed me to celebrate my heritage but also to learn about and appreciate the cultures of others, fostering mutual respect and understanding.",
        "image_soruce":"./events/images/Event2.jpg"
    },

{
        "title": "Provience Universities Exchange Festival",
        "date": "October 2024",
        "location": "Huangshan Univresity, Anhui, China",
        "description": "Visiting Huangshan Mountain was an unforgettable adventure that filled me with awe and inspiration. The breathtaking scenery, with its majestic peaks and ancient pine trees, made every hike feel like a journey through a painting. As I practiced hiking along the winding trails, I felt a sense of freedom and connection to nature, each step helping me to escape the bustling world below.In addition to hiking, I immersed myself in the rich cultural offerings of the area. Visiting local museums provided insight into the history and traditions of the region. I marveled at ancient artifacts and learned about the philosophies that have shaped Chinese culture over centuries. These experiences deepened my appreciation for the heritage that accompanies the breathtaking landscapes. My experience in Huangshan was a harmonious blend of physical challenge, cultural immersion, and connection with others. I returned home not only with memories of stunning landscapes but also with a renewed sense of purpose and inspiration, eager to share the stories and experiences I had gained during my time there.",
        "image_soruce":"./events/images/Event 3.jpg"
    },
    {
        "title": "Visiting of Chinese Historical Museum",
        "date": "July 2024",
        "location": "Jingxian, Anhui, Hefei",
        "description": "Visiting the Chinese Historical Museum in Jingxian, Anhui, was a captivating experience that deepened my understanding of China's rich cultural heritage. As I entered the museum, I was immediately struck by the impressive architecture, which beautifully reflects traditional Chinese design.Walking through the entrance, I felt a sense of excitement and anticipation. The museum’s vast collection promised a journey through time, showcasing various artifacts that narrate the story of China’s history and its diverse ethnic cultures.As I concluded my visit, I felt a profound sense of connection to the history and culture of China. The museum had not only broadened my knowledge but also inspired me to explore more about the cultural narratives that shape our world. Leaving the museum, I carried with me a renewed appreciation for the importance of preserving history and sharing it with future generations.",
        "image_soruce":"./events/images/Event 4.jpg"
    },
    {
        "title": "Session about How to write a Research Paper",
        "date": "December 20, 2024",
        "location": "Online",
        "description": "As a tutor at the session on How to Write a Research Paper for Egyptian junior researchers, my role was both pivotal and fulfilling. I aimed to equip these emerging scholars with the essential skills needed to navigate the complexities of academic writing.During the session, I focused on fostering an interactive atmosphere. I encouraged participants to share their experiences and challenges with writing, creating a collaborative environment. This dialogue not only made the session more engaging but also allowed me to tailor my guidance to their specific needs.I guided the participants through each critical stage of the writing process. Emphasizing the importance of a clear thesis statement, I showed them how to develop a structured outline that organizes their thoughts effectively. We discussed the significance of conducting thorough literature reviews and selecting credible sources to support their arguments.my role as a tutor was not just about imparting knowledge but also about fostering a supportive community among junior researchers. Witnessing their enthusiasm and growth was incredibly rewarding, and I left the session feeling inspired by their potential and commitment to advancing research in Egypt.",
        "image_soruce":"./events/images/Event 6.jpg"
    },
{
        "title": "Session about How to write a Professional CV",
        "date": "December 17, 2024",
        "location": "Online",
        "description": "As a tutor at the session on How to Write a Professional CV my role was to empower participants with the skills and knowledge necessary to create compelling resumes that effectively showcase their qualifications and experiences.During the session, I focused on creating an interactive and supportive environment. I encouraged participants to share their experiences and concerns regarding CV writing, which helped me address their specific needs and foster a sense of camaraderie among attendees.I walked participants through each section of the CV, explaining the purpose and importance of each component. We discussed how to craft a compelling personal statement, effectively list work experience, and highlight relevant skills. I emphasized the need to tailor their CVs to align with the job descriptions they were applying for. My role as a tutor was about more than just teaching technical skills; it was about instilling confidence in participants. Witnessing their progress and enthusiasm for creating professional CVs was incredibly rewarding, and I left the session feeling inspired by their determination to succeed in their careers.",
        "image_soruce":"./events/images/Event 7 .jpg"
    },
    {
        "title": "Session about Food system and antimicrobial resistance (AMR)",
        "date": "August 17, 2024",
        "location": "Online",
        "description": "In preparation for the session, I researched the latest findings on antimicrobial resistance (AMR) within food systems, including its causes and impacts on public health and agriculture. I developed a structured presentation that outlined key concepts, including the role of antibiotics in agriculture, the transmission of resistant bacteria, and effective mitigation strategies.I guided participants through the complexities of the food system and its relation to AMR. We explored the various factors contributing to resistance, such as overuse of antibiotics in livestock and inadequate food safety practices. I provided real-world examples to illustrate these issues, helping participants connect theory to practice. My role as a tutor was to not only impart knowledge but also inspire action and collaboration among participants. Witnessing their engagement and enthusiasm for finding solutions to such a pressing global issue was incredibly rewarding, reinforcing the importance of education in addressing antimicrobial resistance.",
        "image_soruce":"./events/images/Event 8 .jpg"
    },
    {
        "title": "Session about Principles of scientific research",
        "date": "July 20, 2024",
        "location": "Online",
        "description": "In advance of the session, I organized a curriculum that covered the essential principles of scientific research, including formulating hypotheses, designing experiments, data collection, and analysis. I also compiled a list of resources and strategies for effectively locating and accessing journal articles. I introduced the core principles of scientific research, explaining the importance of a structured approach to inquiry. We discussed the scientific method, the significance of reproducibility, and the ethical considerations in research. I emphasized critical thinking and the need for rigorous analysis.I summarized the key principles discussed and encouraged participants to apply what they learned in their future research endeavors. I provided additional resources for further exploration and invited them to reach out for any follow-up questions or support.",
        "image_soruce":"./events/images/Event 9.jpg"
    },
     {
        "title": "Workshop About Food system and Antimicrobial Resistance(AMR)",
        "date": "June 27, 2024",
        "location": "Online by Oxford, Cambridge, and Berlin Universities",
        "description": "I had the privilege of participating in a workshop about the Food System and Antimicrobial Resistance (AMR) hosted by Oxford, Cambridge, and Berlin universities. This event brought together leading experts, researchers, and practitioners to discuss the critical intersection of food systems and AMR.The workshop provided excellent networking opportunities. I connected with fellow researchers and professionals from various fields, fostering collaborations that could lead to future research initiatives. The exchange of ideas and experiences was invaluable, highlighting the importance of interdisciplinary collaboration in tackling AMR.My participation in the workshop deepened my understanding of the complexities surrounding food systems and AMR. I left with a renewed commitment to contribute to research and initiatives aimed at mitigating this critical issue. The insights gained and connections made during the event will undoubtedly influence my future work in this field.",
        "image_soruce":"./events/images/Event10..jpg"
    },
    {
        "title": "Culture Exchange Festival",
        "date": "Novamber 2023",
        "location": "Anhui Agriculture University, Anhui, Hefei",
        "description": "It was a vibrant celebration of diversity and unity. This gathering brought together students and faculty from various backgrounds, creating a platform for sharing traditions, customs, and experiences.As I entered the venue, I was greeted by colorful decorations representing different cultures. The air buzzed with excitement as participants prepared booths showcasing their unique heritages. Each booth was a window into a different world, featuring traditional attire, artifacts, and culinary delights.The culture exchange also provided an excellent opportunity to meet students from other universities. I enjoyed exchanging stories and perspectives, which enriched my understanding of different cultures. The connections made during this event extended beyond cultural exchange, fostering friendships and collaborative opportunities.As the event concluded, I felt a profound sense of gratitude for the opportunity to participate in such a meaningful gathering. The culture exchange at Anhui Agriculture University not only celebrated diversity but also emphasized the importance of mutual respect and understanding. It left me inspired to continue exploring and sharing my own cultural heritage while appreciating the rich tapestry of traditions that exist in our global community.",
        "image_soruce":"./events/images/Chinese 5.jpg"
    },
    {
        "title": "Master Thesis Defense",
        "date": "April 2022",
        "location": "Zagazig University, Zagazig, Egypt",
        "description": "My master's thesis  was about Molecular characterization and Phage biocontrol of Multi-drug Resistant Methicillin-resistant Staphylococcus aureus. This study is focused around controlling of Methicillin resistant Staphylococcus aureus bacteria which isolated from nose patient’s by using both of bacteriophage and plant extract. The antimicrobial ability of two different plant extracts was screened against twenty pathogenic microorganisms. Our study designed to demonstrate the antimicrobial activity of an aqueous Henna (Lawsonia inermis) and Nigella sativa extracts against Methicillin – resistant Staphylococcus aureus. The antibacterial potential of both herbs was checked by agar diffusion method and minimum inhibitory concentration (MIC) assay. Four isolates of Saphylococcus aureus (S.aureus) were inhibited by both extracts. The MIC values of Henna extract ranges (0.5 – 8 µg/ml) less than MIC for Nigella sativa (1 – 8 µg/ml) against MRSA . PCR examination demonstrated that all S.aureus carried the hlg (hemolysin) and icaA ( intracellular adhesion ) genes . Real – time Rt-PCR assays were measured to impact on the harmfulness qualities. Henna(Lawsonia inermis) and Nigella sativa concentrates can be utilized as antimicrobial specialists against S.aureus . ",
        "image_soruce":"./events/images/Event 11.jpg"
    },
    {
        "title": "Academic conference",
        "date": "October 2017",
        "location": "Faculty Of Science, Zagazig University, Zagazig, Egypt",
        "description": "As a speaker at the conference, I had the opportunity to present my talk on (Understanding the Mechanisms of Resistance.) My presentation focused on the various biological and environmental factors contributing to resistance in microbial populations.I concluded my presentation by discussing the implications of these mechanisms for public health and future research. I highlighted the importance of interdisciplinary collaboration in addressing AMR and proposed potential avenues for further investigation. my participation as a speaker was an enriching experience, and I was grateful for the chance to contribute to the ongoing dialogue about understanding and addressing antimicrobial resistance.",
        "image_soruce":"./events/images/Event 12.jpg"
    },
    {
        "title": "Annovation Exhibition",
        "date": "May 2017",
        "location": "Opera House, Cairo, Egypt",
        "description": "Serving as an organizer for the global Innovators’ Exhibition was simultaneously exhilarating and humbling. From the outset, I felt a surge of responsibility knowing that brilliant minds from every corner of the world—engineers from Brazil, social entrepreneurs from Kenya, AI researchers from Japan, and many more—were entrusting our team to showcase their breakthroughs. Coordinating visas, curating booth layouts, and troubleshooting last-minute technical glitches demanded long hours and meticulous attention to detail, yet each challenge reinforced the power of collaboration across cultures and time zones. The moment the exhibition hall doors opened and a vibrant mosaic of languages and ideas filled the space, all fatigue melted into pure pride. Watching participants swap insights, forge partnerships, and leave inspired affirmed why I love building platforms for innovation. By the closing ceremony, I felt both gratified that the event ran smoothly and energized to carry forward this spirit of global creativity into future projects.",
        "image_soruce":"./events/images/Event 14.jpg"
    },
    {
        "title": "Best Presenter at Academic conference",
        "date": "April 2016",
        "location": "Faculty Of Science, Zagazig University, Zagazig, Egypt",
        "description": "Receiving the Best Presenter award at my university’s academic conference left me brimming with pride and gratitude. Hearing my name announced felt almost surreal—an exhilarating blend of relief that my hard work paid off and joy that the audience connected with my research. In that moment, all the late-night revisions and nerves before stepping up to the podium crystallized into a powerful sense of validation. Yet the honor also humbled me: it reminded me that great presentations are never solo achievements but spring from mentors’ guidance, classmates’ feedback, and the supportive energy of the academic community. Above all, the award ignited fresh motivation—I’m eager to dive even deeper into my field, refine my communication skills further, and pay this encouragement forward by helping fellow students shine in their own scholarly journeys.",
        "image_soruce":"./events/images/Event13.jpg"
    },
    {
        "title": "Scientific event",
        "date": "March 2016",
        "location": "Zagazig University, Zagazig, Egypt",
        "description": "Presenting at the scientific event my team and I organized in the university hall felt like stepping into a spotlight we had carefully built together. As team leader, I opened the session by outlining our collective goals—bridging disciplines and showcasing cutting-edge student research—before transitioning into my own talk. Standing behind the podium, I could still picture the countless brainstorming sessions that shaped the program and the floor plan we had walked through only hours earlier to double-check every cable and poster board. My presentation wove our project’s data with the broader narrative of collaborative discovery, and when audience members leaned forward, jotting notes and raising thoughtful questions, I sensed the hall transforming from a lecture venue into a live laboratory of ideas. Concluding with a tribute to my teammates’ dedication, I felt both proud and humbled: proud that our meticulous planning had culminated in a seamless, engaging event, and humbled by the energy and curiosity our peers brought to the discussion.",
        "image_soruce":"./events/images/Event 15.jpg"
    },
    {
        "title": "Fame-Lab Egypt Competition",
        "date": "2014 and 2015",
        "location": "Al-sawy Culture wheel, Cairo, Egypt",
        "description": "Competing in FameLab Egypt challenged me to distill the wonder of science into three electrifying minutes that anyone—even those who never set foot in a classroom—could enjoy. I chose a theory that usually lives inside dense textbooks, then stripped it to its elegant core, swapping equations for vivid metaphors and everyday props I could hold in one hand. Rehearsing in front of mirrors, friends, and anybody who would listen on the metro, I learned to read faces for that flicker of comprehension that says “Aha, I get it!” When my turn came on stage, the spotlight felt less like pressure and more like an invitation to share a story; every nod, laugh, and wide-eyed “wow” from the audience affirmed that simplicity can be powerful without being simplistic. Walking off to applause, I was exhilarated—and newly convinced that science belongs to everyone, provided we meet people where they are with clarity, respect, and a touch of delight.",
        "image_soruce":"./events/images/Event 16.jpg"
    }
    
    
    
    
    





    
]

